-- Adminer 4.7.7 MySQL dump

SET NAMES utf8;
SET time_zone = '+00:00';
SET foreign_key_checks = 0;
SET sql_mode = 'NO_AUTO_VALUE_ON_ZERO';

DROP DATABASE IF EXISTS `bot_db`;
CREATE DATABASE `bot_db` /*!40100 DEFAULT CHARACTER SET latin1 */;
USE `bot_db`;

SET NAMES utf8mb4;

DROP TABLE IF EXISTS `bot_addreses`;
CREATE TABLE `bot_addreses` (
  `ID` int(11) DEFAULT NULL,
  `NAME` text COLLATE utf8mb4_unicode_ci
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

INSERT INTO `bot_addreses` (`ID`, `NAME`) VALUES
(1,	'Парковая 22'),
(2,	'Заводская 7'),
(3,	'Набережная 50'),
(4,	'Набережная 46'),
(5,	'Парковая 16'),
(6,	'Парковая 18'),
(7,	'Парковая 48'),
(8,	'Парковая 52'),
(9,	'Парковая 46'),
(10,	'Парковая 44'),
(11,	'Набережная 71'),
(12,	'Набережная 73'),
(13,	'Набережная 74'),
(14,	'Набережная 75'),
(15,	'Парковая 62'),
(16,	'Парковая 54'),
(17,	'Парковая 66'),
(18,	'Парковая 68'),
(19,	'Парковая 17'),
(20,	'Молодёжная 4'),
(21,	'Парковая 19'),
(22,	'Молодёжная 2'),
(23,	'Заводская 3'),
(24,	'Парковая 15'),
(25,	'Парковая 13'),
(26,	'Парковая 3'),
(27,	'Парковая 11'),
(28,	'Парковая 7'),
(29,	'Парковая 9'),
(30,	'Парковая 8'),
(31,	'Парковая 10'),
(32,	'Набережная 40'),
(33,	'Парковая 14'),
(34,	'Парковая 2'),
(35,	'Парковая 4'),
(36,	'Энергетиков 14'),
(37,	'Энергетиков 10'),
(38,	'Энергетиков 8'),
(39,	'Энергетиков 12'),
(40,	'Набережная 38'),
(41,	'Набережная 34'),
(42,	'Набережная 30'),
(43,	'Набережная 26'),
(44,	'Энергетиков 4'),
(45,	'Ленина 20'),
(46,	'Строителей 2А'),
(47,	'Строителей 2Б'),
(48,	'Мира 58'),
(49,	'Мира 60'),
(50,	'Строителей 6'),
(51,	'Строителей 6Б'),
(52,	'Строителей 5А'),
(53,	'Мира 56А'),
(54,	'Ленина 12'),
(55,	'Ленина 8'),
(56,	'Ленина 4'),
(57,	'Ленина 2'),
(58,	'Энергетиков 1Б'),
(59,	'Энергетиков 1А'),
(60,	'Энергетиков 3А'),
(61,	'Энергетиков 3'),
(62,	'Заводская 10А'),
(63,	'Заводская 10'),
(64,	'Энергетиков 5'),
(65,	'Энергетиков 1'),
(66,	'Мира 65'),
(67,	'Мира 47'),
(68,	'Мира 63'),
(69,	'Первомайская 11'),
(70,	'Дзержинского 6'),
(71,	'Мира 57'),
(72,	'Дзержинского 2'),
(73,	'Мира 59'),
(74,	'Мира 43А'),
(75,	'Первомайская 13'),
(76,	'Калинина 9А'),
(77,	'Первомайская 14'),
(78,	'Мира 61'),
(79,	'Мира 45'),
(80,	'Первомайская 12В'),
(81,	'Калинина 13Б'),
(82,	'Калинина 13'),
(83,	'Первомайская 12А'),
(84,	'Комсомольская 24'),
(85,	'Мира 53'),
(86,	'Калинина 13А'),
(87,	'Калинина 11'),
(88,	'Калинина 9'),
(89,	'Калинина 3'),
(90,	'Калинина 11А'),
(91,	'Комсомольская 34А'),
(92,	'Комсомольская 30Б'),
(93,	'Калинина 5'),
(94,	'Первомайская 8'),
(95,	'Комсомольская 28'),
(96,	'Калинина 7А'),
(97,	'Комсомольская 36'),
(98,	'Первомайская 8Б'),
(99,	'Комсомольская 26'),
(100,	'Калинина 7'),
(101,	'Комсомольская 30'),
(102,	'Калинина 7Б'),
(103,	'Комсомольская 34'),
(104,	'Комсомольская 38'),
(105,	'Калинина 7В'),
(106,	'Заводская 4'),
(107,	'Заводская 6'),
(108,	'Первомайская 8В'),
(109,	'Комсомольская 34Б'),
(110,	'Комсомольская 30А'),
(111,	'Заводская 8'),
(112,	'Мира 51'),
(113,	'Мира 49'),
(114,	'Мира 41А'),
(115,	'Первомайская 16'),
(116,	'Калинина 15'),
(117,	'Первомайская 12Б'),
(118,	'Мира 43'),
(119,	'Мира 39А'),
(120,	'Калинина 17'),
(121,	'Мира 33'),
(122,	'Мира 39'),
(123,	'Мира 35'),
(124,	'Мира 37'),
(125,	'Калинина 13В'),
(126,	'Мира 43Б'),
(127,	'Мира 39Б'),
(128,	'Мира 46'),
(129,	'Мира 48'),
(130,	'Мира 50'),
(131,	'Гагарина 27'),
(132,	'Мира 44'),
(133,	'Гагарина 25'),
(134,	'Молодёжная 9'),
(135,	'Гагарина 17'),
(136,	'Мира 38'),
(137,	'Молодёжная 7'),
(138,	'Мира 36'),
(139,	'Калинина 23'),
(140,	'Молодёжная 3'),
(141,	'Молодёжная 5'),
(142,	'Мира 34'),
(143,	'Калинина 19'),
(144,	'Строителей 10'),
(145,	'Калинина 6'),
(146,	'Калинина 12'),
(147,	'Калинина 4'),
(148,	'Мира 27'),
(149,	'Мира 25'),
(150,	'Калинина 10'),
(151,	'Мира 19'),
(152,	'Мира 27А'),
(153,	'Мира 21А'),
(154,	'Мира 29'),
(155,	'Мира 23'),
(156,	'Мира 21'),
(157,	'Набережная 6А'),
(158,	'Комсомольская 8А'),
(159,	'Советская 1'),
(160,	'Советская 3'),
(161,	'Советская 7'),
(162,	'Комсомольская 10Б'),
(163,	'Комсомольская 10А'),
(164,	'Комсомольская 6'),
(165,	'Комсомольская 14'),
(166,	'Комсомольская 12'),
(167,	'Советская 6Б'),
(168,	'Мира 3'),
(169,	'Мира 11'),
(170,	'Набережная 2Б'),
(171,	'Набережная 4А'),
(172,	'Советская 4'),
(173,	'Советская 4А'),
(174,	'Советская 10'),
(175,	'Советская 2'),
(176,	'Комсомольская 14А'),
(177,	'Набережная 6'),
(178,	'Набережная 2'),
(179,	'Комсомольская 10'),
(180,	'Комсомольская 4'),
(181,	'Набережная 1'),
(182,	'Набережная 2А'),
(183,	'Советская 8'),
(184,	'Советская 8А'),
(185,	'Комсомольская 12А'),
(186,	'Ленина 13'),
(187,	'Ленина 23'),
(188,	'Ленина 39'),
(189,	'Ленина 5'),
(190,	'Ленина 31'),
(191,	'Строителей 4'),
(192,	'Бортникова 36'),
(193,	'Бортникова 44'),
(194,	'Строителей 17'),
(195,	'Бортникова 20'),
(196,	'Бортникова 30'),
(197,	'Бортникова 26'),
(198,	'Строителей 21А'),
(199,	'Бортникова 22'),
(200,	'Строителей 5'),
(201,	'Строителей 6А'),
(202,	'Строителей 9'),
(203,	'Строителей 15'),
(204,	'Строителей 13'),
(205,	'Строителей 7'),
(206,	'Строителей 25'),
(207,	'Бортникова 46'),
(208,	'Бортникова 18'),
(209,	'Строителей 14'),
(210,	'Строителей 16'),
(211,	'Строителей 18'),
(212,	'Строителей 20'),
(213,	'Строителей 24'),
(214,	'Песчаная 3'),
(215,	'Набережная 16'),
(216,	'Ленина 3'),
(217,	'Ленина 7'),
(218,	'Набережная 18'),
(219,	'Ленина 15'),
(220,	'Ленина 19'),
(221,	'Ленина 11'),
(222,	'Бортникова 2'),
(223,	'Ленина 21'),
(224,	'Мира 10Б'),
(225,	'Бортникова 12'),
(226,	'Ленина 35'),
(227,	'Бортникова 8'),
(228,	'Ленина 37'),
(229,	'Мира 10В'),
(230,	'Мира 4А'),
(231,	'Ленина 27'),
(232,	'Мира 8А'),
(233,	'Мира 4'),
(234,	'Мира 8'),
(235,	'Набережная 12'),
(236,	'Набережная 10'),
(237,	'Бортникова 10'),
(238,	'Бортникова 4'),
(239,	'Мира 10А'),
(240,	'Мира 8Б'),
(241,	'Ленина 9'),
(242,	'Набережная 12А'),
(243,	'Ленина 25'),
(244,	'Набережная 10А'),
(245,	'Набережная 16А'),
(246,	'Бортникова 7'),
(247,	'Гагарина 7'),
(248,	'Бортникова 11'),
(249,	'Гагарина 3'),
(250,	'Бортникова 5'),
(251,	'Гагарина 9'),
(252,	'Гагарина 1'),
(253,	'Мира 18А'),
(254,	'Гагарина 15'),
(255,	'Мира 16А'),
(256,	'Мира 20А'),
(257,	'Калинина 20'),
(258,	'Гагарина 13'),
(259,	'Мира 20'),
(260,	'Мира 16'),
(261,	'Мира 18'),
(262,	'Мира 24'),
(263,	'Мира 28'),
(264,	'Мира 24А'),
(265,	'Мира 26'),
(266,	'Калинина 18'),
(267,	'Бортникова 15'),
(268,	'Бортникова 21'),
(269,	'Бортникова 19'),
(270,	'Бортникова 16'),
(271,	'Строителей 11'),
(272,	'Строителей 27'),
(273,	'Строителей 23'),
(274,	'Бортникова 48'),
(275,	'Строителей 21'),
(276,	'Бортникова 38'),
(277,	'Бортникова 42'),
(278,	'Бортникова 32'),
(279,	'Первомайская 12'),
(280,	'Первомайская 14А'),
(281,	'Первомайская 2'),
(282,	'Первомайская 6'),
(283,	'Первомайская 4'),
(284,	'Первомайская 10А'),
(285,	'Гагарина 20'),
(286,	'Гагарина 24'),
(287,	'Гагарина 22'),
(288,	'Гагарина 16'),
(289,	'Набережная 66'),
(290,	'Набережная 70'),
(291,	'Набережная 72'),
(292,	'Набережная 68'),
(293,	'Набережная 52'),
(294,	'Парковая 32'),
(295,	'Парковая 38'),
(296,	'Парковая 28'),
(297,	'Парковая 34'),
(298,	'Мира 55'),
(299,	'Дзержинского 6А'),
(300,	'Мира 75'),
(301,	'Дзержинского 14'),
(302,	'Дзержинского 12'),
(303,	'Дзержинского 10'),
(304,	'Мира 67'),
(305,	'Мира 73'),
(306,	'Мира 62'),
(307,	'Лазо 2А'),
(308,	'Дзержинского 8'),
(309,	'Дзержинского 16'),
(310,	'Набережная 48'),
(311,	'Строителей 3'),
(312,	'Парковая 64'),
(313,	'Парковая 58'),
(314,	'Парковая 56'),
(315,	'Парковая 60'),
(316,	'Набережная 78'),
(317,	'Набережная 76'),
(318,	'Мира 69'),
(319,	'Советская 6'),
(320,	'Набережная 58'),
(321,	'Набережная 8'),
(322,	'Парковая 26'),
(323,	'Калинина 17А'),
(324,	'Парковая 72'),
(325,	'Парковая 74'),
(326,	'Энергетиков 2'),
(327,	'Бортникова 9'),
(328,	'Строителей 8');

DROP TABLE IF EXISTS `bot_admins`;
CREATE TABLE `bot_admins` (
  `ID` int(11) DEFAULT NULL,
  `Name` text COLLATE utf8mb4_unicode_ci,
  `TelegrammID` int(11) DEFAULT NULL,
  `OrgID` int(11) DEFAULT NULL,
  `RulesID` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

INSERT INTO `bot_admins` (`ID`, `Name`, `TelegrammID`, `OrgID`, `RulesID`) VALUES
(1,	'admin',	0,	1,	1);

DROP TABLE IF EXISTS `bot_elog`;
CREATE TABLE `bot_elog` (
  `ID` int(11) DEFAULT NULL,
  `EventID` int(11) DEFAULT NULL,
  `OperatorID` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;


DROP TABLE IF EXISTS `bot_estatus`;
CREATE TABLE `bot_estatus` (
  `Id` int(11) DEFAULT NULL,
  `Name` text COLLATE utf8mb4_unicode_ci
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

INSERT INTO `bot_estatus` (`Id`, `Name`) VALUES
(1,	'Выполняется');

DROP TABLE IF EXISTS `bot_etimer`;
CREATE TABLE `bot_etimer` (
  `ID` int(11) DEFAULT NULL,
  `Name` text COLLATE utf8mb4_unicode_ci,
  `StartTime` datetime DEFAULT NULL,
  `StopTime` datetime DEFAULT NULL,
  `SendTime` datetime DEFAULT NULL,
  `Repeat` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

INSERT INTO `bot_etimer` (`ID`, `Name`, `StartTime`, `StopTime`, `SendTime`, `Repeat`) VALUES
(1,	'Сутки',	'2020-05-31 12:00:05',	'2020-05-31 13:04:16',	'2020-05-30 13:04:22',	0);

DROP TABLE IF EXISTS `bot_events`;
CREATE TABLE `bot_events` (
  `ID` int(11) DEFAULT NULL,
  `Name` text COLLATE utf8mb4_unicode_ci,
  `UserID` int(11) DEFAULT NULL,
  `EventID` int(11) DEFAULT NULL,
  `TimerID` int(11) DEFAULT NULL,
  `SendAt` datetime DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

INSERT INTO `bot_events` (`ID`, `Name`, `UserID`, `EventID`, `TimerID`, `SendAt`) VALUES
(1,	'Обычная подписка',	1,	1,	1,	'2020-05-31 06:48:35');

DROP TABLE IF EXISTS `bot_eweight`;
CREATE TABLE `bot_eweight` (
  `Id` int(11) DEFAULT NULL,
  `Name` text COLLATE utf8mb4_unicode_ci
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

INSERT INTO `bot_eweight` (`Id`, `Name`) VALUES
(1,	'Важное');

DROP TABLE IF EXISTS `bot_idevents`;
CREATE TABLE `bot_idevents` (
  `Id` int(11) DEFAULT NULL,
  `Name` text COLLATE utf8mb4_unicode_ci,
  `AlertID` int(11) DEFAULT NULL,
  `StatusID` int(11) DEFAULT NULL,
  `AdrID` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

INSERT INTO `bot_idevents` (`Id`, `Name`, `AlertID`, `StatusID`, `AdrID`) VALUES
(1,	'Отключение воды',	1,	1,	1);

DROP TABLE IF EXISTS `bot_msglog`;
CREATE TABLE `bot_msglog` (
  `ID` int(11) NOT NULL,
  `UserID` int(11) DEFAULT NULL,
  `MagText` text COLLATE utf8mb4_unicode_ci,
  PRIMARY KEY (`ID`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;


DROP TABLE IF EXISTS `bot_org`;
CREATE TABLE `bot_org` (
  `Id` int(11) DEFAULT NULL,
  `Name` text COLLATE utf8mb4_unicode_ci
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;


DROP TABLE IF EXISTS `bot_rules`;
CREATE TABLE `bot_rules` (
  `Id` int(11) DEFAULT NULL,
  `EventId` int(11) DEFAULT NULL,
  `OrgID` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;


DROP TABLE IF EXISTS `bot_users`;
CREATE TABLE `bot_users` (
  `ID` int(11) NOT NULL AUTO_INCREMENT,
  `Name` text COLLATE utf8mb4_unicode_ci,
  `TelegrammID` int(11) DEFAULT NULL,
  `AddressID` int(11) DEFAULT NULL,
  `Subscribe` tinyint(1) DEFAULT '0',
  `Phone` text COLLATE utf8mb4_unicode_ci,
  PRIMARY KEY (`ID`),
  UNIQUE KEY `bot_users_TelegrammID_uindex` (`TelegrammID`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;


-- 2020-05-31 06:53:33

